ZigEmbeddedGroup/microzig/port/nxp/lpc/src/chips/LPC176x5x.svd
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P1.31 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P1.31 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P1.31 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P1.31 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINMODE4</name>																	
		<description>Pin mode select register 4</description>																	
		<addressOffset>0x050</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>P2_00MODE</name>															
				<description>Port 2 pin 0 control.</description>															
				<bitRange>[1:0]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.0 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.0 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.0 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.0 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_01MODE</name>															
				<description>Port 2 pin 1 control.</description>															
				<bitRange>[3:2]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.1 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.1 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.1 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.1 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_02MODE</name>															
				<description>Port 2 pin 2 control.</description>															
				<bitRange>[5:4]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.2 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.2 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.2 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.2 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_03MODE</name>															
				<description>Port 2 pin 3 control.</description>															
				<bitRange>[7:6]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.3 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.3 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.3 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.3 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_04MODE</name>															
				<description>Port 2 pin 4 control.</description>															
				<bitRange>[9:8]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.4 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.4 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.4 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.4 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_05MODE</name>															
				<description>Port 2 pin 5 control.</description>															
				<bitRange>[11:10]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.5 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.5 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.5 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.5 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_06MODE</name>															
				<description>Port 2 pin 6 control.</description>															
				<bitRange>[13:12]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.6 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.6 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.6 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.6 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_07MODE</name>															
				<description>Port 2 pin 7 control.</description>															
				<bitRange>[15:14]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.7 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.7 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.7 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.7 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_08MODE</name>															
				<description>Port 2 pin 8 control.</description>															
				<bitRange>[17:16]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.8 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.8 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.8 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.8 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_09MODE</name>															
				<description>Port 2 pin 9 control.</description>															
				<bitRange>[19:18]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.9 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.9 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.9 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.9 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_10MODE</name>															
				<description>Port 2 pin 10 control.</description>															
				<bitRange>[21:20]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.10 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.10 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.10 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.10 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_11MODE</name>															
				<description>Port 2 pin 11 control.</description>															
				<bitRange>[23:22]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.11 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.11 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.11 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.11 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_12MODE</name>															
				<description>Port 2 pin 12 control.</description>															
				<bitRange>[25:24]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.12 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.12 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.12 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.12 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_13MODE</name>															
				<description>Port 2 pin 13 control.</description>															
				<bitRange>[27:26]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>PULL_UP</name>													
						<description>Pull-up. P2.13 pin has a pull-up resistor enabled.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>REPEATER</name>													
						<description>Repeater. P2.13 pin has repeater mode enabled.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>DISABLED</name>													
						<description>Disabled. P2.13 pin has neither pull-up nor pull-down.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>PULL_DOWN</name>													
						<description>Pull-down. P2.13 has a pull-down resistor enabled.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:28]</bitRange>															
																			
														
