ZigEmbeddedGroup/microzig/port/nxp/lpc/src/chips/LPC176x5x.svd
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P2.8 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P2.8 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_09OD</name>															
				<description>Port 2 pin 9 open drain mode control, see P2.00OD</description>															
				<bitRange>[9:9]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P2.9 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P2.9 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_10OD</name>															
				<description>Port 2 pin 10 open drain mode control, see P2.00OD</description>															
				<bitRange>[10:10]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P2.10 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P2.10 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_11OD</name>															
				<description>Port 2 pin 11 open drain mode control, see P2.00OD</description>															
				<bitRange>[11:11]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P2.11 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P2.11 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_12OD</name>															
				<description>Port 2 pin 12 open drain mode control, see P2.00OD</description>															
				<bitRange>[12:12]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P2.12 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P2.12 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>P2_13OD</name>															
				<description>Port 2 pin 13 open drain mode control, see P2.00OD</description>															
				<bitRange>[13:13]</bitRange>															
																			
				<enumeratedValues>															
				<name>ENUM</name>															
																			
					<enumeratedValue>														
						<name>NORMAL</name>													
						<description>Normal. P2.13 pin is in the normal (not open drain) mode.</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>OPEN_DRAIN</name>													
						<description>Open-drain. P2.13 pin is in the open drain mode.</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[31:14]</bitRange>															
																			
														
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>PINMODE_OD3</name>																	
		<description>Open drain mode control register 3</description>																	
		<addressOffset>0x074</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[24:0]</bitRange>															
																			
														
