ZigEmbeddedGroup/microzig/port/nxp/lpc/src/chips/LPC176x5x.svd
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>EXTPOLAR</name>																	
		<description>External Interrupt Polarity Register</description>																	
		<addressOffset>0x14C</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>EXTPOLAR0</name>															
				<description>External interrupt 0 EINT0 polarity.</description>															
				<bitRange>[0:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>FALLING_EDGE</name>													
						<description>Falling edge. EINT0 is low-active or falling-edge sensitive (depending on EXTMODE0).</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RISING_EDGE</name>													
						<description>Rising edge. EINT0 is high-active or rising-edge sensitive (depending on EXTMODE0).</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>EXTPOLAR1</name>															
				<description>External interrupt 1 EINT1 polarity.</description>															
				<bitRange>[1:1]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>FALLING_EDGE</name>													
						<description>Falling edge. EINT1 is low-active or falling-edge sensitive (depending on EXTMODE1).</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RISING_EDGE</name>													
						<description>Rising edge. EINT1 is high-active or rising-edge sensitive (depending on EXTMODE1).</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>EXTPOLAR2</name>															
				<description>External interrupt 2 EINT2 polarity.</description>															
				<bitRange>[2:2]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>FALLING_EDGE</name>													
						<description>Falling edge. EINT2 is low-active or falling-edge sensitive (depending on EXTMODE2).</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RISING_EDGE</name>													
						<description>Rising edge. EINT2 is high-active or rising-edge sensitive (depending on EXTMODE2).</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>EXTPOLAR3</name>															
				<description>External interrupt 3 EINT3 polarity.</description>															
				<bitRange>[3:3]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>FALLING_EDGE</name>													
						<description>Falling edge. EINT3 is low-active or falling-edge sensitive (depending on EXTMODE3).</description>													
						<value>0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>RISING_EDGE</name>													
						<description>Rising edge. EINT3 is high-active or rising-edge sensitive (depending on EXTMODE3).</description>													
						<value>1</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:4]</bitRange>															
															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>RSID</name>																	
		<description>Reset Source Identification Register</description>																	
		<addressOffset>0x180</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0x00000000</resetMask>																	
		<fields>																	
			<field>																
				<name>POR</name>															
				<description>Assertion of the POR signal sets this bit, and clears all of the other bits in this register. But if another Reset signal (e.g., External Reset) remains asserted after the POR signal is negated, then its bit is set. This bit is not affected by any of the other sources of Reset.</description>															
				<bitRange>[0:0]</bitRange>															
			</field>																
			<field>																
				<name>EXTR</name>															
				<description>Assertion of the RESET signal sets this bit. This bit is cleared only by software or POR.</description>															
				<bitRange>[1:1]</bitRange>															
			</field>																
			<field>																
				<name>WDTR</name>															
				<description>This bit is set when the Watchdog Timer times out and the WDTRESET bit in the Watchdog Mode Register is 1. This bit is cleared only by software or POR.</description>															
				<bitRange>[2:2]</bitRange>															
			</field>																
			<field>																
				<name>BODR</name>															
				<description>This bit is set when the VDD(REG)(3V3) voltage reaches a level below the BOD reset trip level (typically 1.85 V under nominal room temperature conditions). If the VDD(REG)(3V3) voltage dips from the normal operating range to below the BOD reset trip level and recovers, the BODR bit will be set to 1. If the VDD(REG)(3V3) voltage dips from the normal operating range to below the BOD reset trip level and continues to decline to the level at which POR is asserted (nominally 1 V), the BODR bit is cleared. If the VDD(REG)(3V3) voltage rises continuously from below 1 V to a level above the BOD reset trip level, the BODR will be set to 1. This bit is cleared only by software or POR. Note: Only in the case where a reset occurs and the POR = 0, the BODR bit indicates if the VDD(REG)(3V3) voltage was below the BOD reset trip level or not.</description>															
				<bitRange>[3:3]</bitRange>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:4]</bitRange>															
			</field>																
		</fields>																	
	</register>																		
	<register>																		
		<name>SCS</name>																	
		<description>System control and status</description>																	
		<addressOffset>0x1A0</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>RESERVED</name>															
				<description>Reserved. User software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[3:0]</bitRange>															
															
