ZigEmbeddedGroup/microzig/port/nxp/lpc/src/chips/LPC176x5x.svd
			</field>																
			<field>																
				<name>PCLK_SSP0</name>															
				<description>Peripheral clock selection for SSP0.</description>															
				<bitRange>[11:10]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_TIMER2</name>															
				<description>Peripheral clock selection for TIMER2.</description>															
				<bitRange>[13:12]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_TIMER3</name>															
				<description>Peripheral clock selection for TIMER3.</description>															
				<bitRange>[15:14]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_UART2</name>															
				<description>Peripheral clock selection for UART2.</description>															
				<bitRange>[17:16]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_UART3</name>															
				<description>Peripheral clock selection for UART3.</description>															
				<bitRange>[19:18]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_I2C2</name>															
				<description>Peripheral clock selection for I2C2.</description>															
				<bitRange>[21:20]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_I2S</name>															
				<description>Peripheral clock selection for I2S.</description>															
				<bitRange>[23:22]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved.</description>															
				<bitRange>[25:24]</bitRange>															
															
