ZigEmbeddedGroup/microzig/port/nxp/lpc/src/chips/LPC176x5x.svd
			</field>																
			<field>																
				<name>PCLK_RIT</name>															
				<description>Peripheral clock selection for Repetitive Interrupt Timer.</description>															
				<bitRange>[27:26]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_SYSCON</name>															
				<description>Peripheral clock selection for the System Control block.</description>															
				<bitRange>[29:28]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>PCLK_MC</name>															
				<description>Peripheral clock selection for the Motor Control PWM.</description>															
				<bitRange>[31:30]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>CCLK_DIV_4</name>													
						<description>CCLK div 4. PCLK_peripheral = CCLK/4</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK</name>													
						<description>CCLK. PCLK_peripheral = CCLK</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_2</name>													
						<description>CCLK div 2. PCLK_peripheral = CCLK/2</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>CCLK_DIV_8</name>													
						<description>CCLK div 8. PCLK_peripheral = CCLK/8</description>													
						<value>0x3</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
		</fields>																	
	</register>
			<register>
				<name>USBINTST</name>
				<description>USB Interrupt Status</description>
				<addressOffset>0x1C0</addressOffset>
				<access>read-write</access>
				<resetValue>0x80000000</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>USB_INT_REQ_LP</name>
						<description>Low priority interrupt line status. This bit is read-only.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>USB_INT_REQ_HP</name>
						<description>High priority interrupt line status. This bit is read-only.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>USB_INT_REQ_DMA</name>
						<description>DMA interrupt line status. This bit is read-only.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>USB_HOST_INT</name>
						<description>USB host interrupt line status. This bit is read-only.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>USB_ATX_INT</name>
						<description>External ATX interrupt line status. This bit is read-only.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>USB_OTG_INT</name>
						<description>OTG interrupt line status. This bit is read-only.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>USB_I2C_INT</name>
						<description>I2C module interrupt line status. This bit is read-only.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Read value is undefined, only zero should be written.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>USB_NEED_CLK</name>
						<description>USB need clock indicator. This bit is read-only. This bit is set to 1 when USB activity or a change of state on the USB data pins is detected, and it indicates that a PLL supplied clock of 48 MHz is needed. Once USB_NEED_CLK becomes one, it resets to zero 5 ms after the last packet has been received/sent, or 2 ms after the Suspend Change (SUS_CH) interrupt has occurred. A change of this bit from 0 to 1 can wake up the microcontroller if activity on the USB bus is selected to wake up the part from the Power-down mode (see Section 4.7.9 Wake-up from Reduced Power Modes for details). Also see Section 4.5.8 PLLs and Power-down mode and Section 4.7.10 Power Control for Peripherals register (PCONP - 0x400F C0C4) for considerations about the PLL and invoking the Power-down mode. This bit is read-only.</description>
						<bitRange>[8:8]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Read value is undefined, only zero should be written.</description>
						<bitRange>[30:9]</bitRange>
					</field>
					<field>
						<name>EN_USB_INTS</name>
						<description>Enable all USB interrupts. When this bit is cleared, the NVIC does not see the ORed output of the USB interrupt lines.</description>
						<bitRange>[31:31]</bitRange>
					</field>
				</fields>
			</register>
			<register>
				<name>DMACREQSEL</name>
				<description>Selects between alternative requests on DMA channels 0 through 7 and 10 through 15</description>
				<addressOffset>0x1C4</addressOffset>
				<access>read-write</access>
				<resetValue>0</resetValue>
				<resetMask>0xFFFFFFFF</resetMask>
				<fields>
					<field>
						<name>DMASEL08</name>
						<description>Selects the DMA request for GPDMA input 8: 0 - uart0 tx  1 - Timer 0 match 0 is selected.</description>
						<bitRange>[0:0]</bitRange>
					</field>
					<field>
						<name>DMASEL09</name>
						<description>Selects the DMA request for GPDMA input 9: 0 - uart0 rx 1 - Timer 0 match 1 is selected.</description>
						<bitRange>[1:1]</bitRange>
					</field>
					<field>
						<name>DMASEL10</name>
						<description>Selects the DMA request for GPDMA input 10: 0 - uart1 tx  is selected. 1 - Timer 1 match 0 is selected.</description>
						<bitRange>[2:2]</bitRange>
					</field>
					<field>
						<name>DMASEL11</name>
						<description>Selects the DMA request for GPDMA input 11: 0 - uart1 rx  is selected. 1 - Timer 1 match 1 is selected.</description>
						<bitRange>[3:3]</bitRange>
					</field>
					<field>
						<name>DMASEL12</name>
						<description>Selects the DMA request for GPDMA input 12: 0 - uart2 tx  is selected. 1 - Timer 2 match 0 is selected.</description>
						<bitRange>[4:4]</bitRange>
					</field>
					<field>
						<name>DMASEL13</name>
						<description>Selects the DMA request for GPDMA input 13: 0 - uart2 rx  is selected. 1 - Timer 2 match 1 is selected.</description>
						<bitRange>[5:5]</bitRange>
					</field>
					<field>
						<name>DMASEL14</name>
						<description>Selects the DMA request for GPDMA input 14: 0 - uart3 tx  is selected. 1 - I2S channel 0 is selected.</description>
						<bitRange>[6:6]</bitRange>
					</field>
					<field>
						<name>DMASEL15</name>
						<description>Selects the DMA request for GPDMA input 15: 0 - uart3 rx is selected. 1 - I2S channel 1 is selected.</description>
						<bitRange>[7:7]</bitRange>
					</field>
					<field>
						<name>RESERVED</name>
						<description>Reserved. Read value is undefined, only zero should be written.</description>
						<bitRange>[31:8]</bitRange>
					</field>
				
				</fields>
			</register>		
	<register>																		
		<name>CLKOUTCFG</name>																	
		<description>Clock Output Configuration Register</description>																	
		<addressOffset>0x1C8</addressOffset>																	
		<access>read-write</access>																	
		<resetValue>0</resetValue>																	
		<resetMask>0xFFFFFFFF</resetMask>																	
		<fields>																	
			<field>																
				<name>CLKOUTSEL</name>															
				<description>Selects the clock source for the CLKOUT function. Other values are reserved. Do not use.</description>															
				<bitRange>[3:0]</bitRange>															
				<enumeratedValues>															
				<name>ENUM</name>															
					<enumeratedValue>														
						<name>SELECTS_THE_CPU_CLOC</name>													
						<description>Selects the CPU clock as the CLKOUT source.</description>													
						<value>0x0</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SELECTS_THE_MAIN_OSC</name>													
						<description>Selects the main oscillator as the CLKOUT source.</description>													
						<value>0x1</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SELECTS_THE_INTERNAL</name>													
						<description>Selects the Internal RC oscillator as the CLKOUT source.</description>													
						<value>0x2</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SELECTS_THE_USB_CLOC</name>													
						<description>Selects the USB clock as the CLKOUT source.</description>													
						<value>0x3</value>													
					</enumeratedValue>														
					<enumeratedValue>														
						<name>SELECTS_THE_RTC_OSCI</name>													
						<description>Selects the RTC oscillator as the CLKOUT source.</description>													
						<value>0x4</value>													
					</enumeratedValue>														
				</enumeratedValues>															
			</field>																
			<field>																
				<name>CLKOUTDIV</name>															
				<description>Integer value to divide the output clock by, minus one. 0 = Clock is divided by 1 1 = Clock is divided by 2. 2 = Clock is divided by 3. ... 15 = Clock is divided by 16.</description>															
				<bitRange>[7:4]</bitRange>															
															
