ZigEmbeddedGroup/microzig/port/nxp/lpc/src/chips/LPC176x5x.svd
			</field>																
			<field>																
				<name>CLKOUT_EN</name>															
				<description>CLKOUT enable control, allows switching the CLKOUT source without glitches. Clear to stop CLKOUT on the next falling edge. Set to enable CLKOUT.</description>															
				<bitRange>[8:8]</bitRange>															
															
			</field>																
			<field>																
				<name>CLKOUT_ACT</name>															
				<description>CLKOUT activity indication. Reads as 1 when CLKOUT is enabled. Read as 0 when CLKOUT has been disabled via the CLKOUT_EN bit and the clock has completed being stopped.</description>															
				<bitRange>[9:9]</bitRange>															
															
			</field>																
			<field>																
				<name>RESERVED</name>															
				<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>															
				<bitRange>[31:10]</bitRange>															
															
			</field>																
		</fields>																	
	</register>																		
																			
</registers>																			
																			
																			
																			
																			
																			

</peripheral>

	
		<peripheral>
	<name>EMAC</name>
	<description>Ethernet</description>
	<groupName>ETHERNET</groupName>
	<baseAddress>0x50000000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>ENET</name>
	<value>28</value>
	</interrupt>
	<registers>
		<register>
			<name>MAC1</name>
			<description>MAC configuration register 1.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0x8000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RXENABLE</name>
					<description>RECEIVE ENABLE. Set this to allow receive frames to be received. Internally the MAC synchronizes this control bit to the incoming receive stream.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>PARF</name>
					<description>PASS ALL RECEIVE FRAMES. When enabled (set to 1), the MAC will pass all frames regardless of type (normal vs. Control). When disabled, the MAC does not pass valid Control frames.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RXFLOWCTRL</name>
					<description>RX FLOW CONTROL. When enabled (set to 1), the MAC acts upon received PAUSE Flow Control frames. When disabled, received PAUSE Flow Control frames are ignored.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>TXFLOWCTRL</name>
					<description>TX FLOW CONTROL. When enabled (set to 1), PAUSE Flow Control frames are allowed to be transmitted. When disabled, Flow Control frames are blocked.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>LOOPBACK</name>
					<description>Setting this bit will cause the MAC Transmit interface to be looped back to the MAC Receive interface. Clearing this bit results in normal operation.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[7:5]</bitRange>
				</field>
				<field>
					<name>RESETTX</name>
					<description>Setting this bit will put the Transmit Function logic in reset.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESETMCSTX</name>
					<description>Setting this bit resets the MAC Control Sublayer / Transmit logic. The MCS logic implements flow control.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESETRX</name>
					<description>Setting this bit will put the Ethernet receive logic in reset.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RESETMCSRX</name>
					<description>Setting this bit resets the MAC Control Sublayer / Receive logic. The MCS logic implements flow control.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[13:12]</bitRange>
				</field>
				<field>
					<name>SIMRESET</name>
					<description>SIMULATION RESET. Setting this bit will cause a reset to the random number generator within the Transmit Function.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>SOFTRESET</name>
					<description>SOFT RESET. Setting this bit will put all modules within the MAC in reset except the Host Interface.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MAC2</name>
			<description>MAC configuration register 2.</description>
			<addressOffset>0x004</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FULLDUPLEX</name>
					<description>When enabled (set to 1), the MAC operates in Full-Duplex mode. When disabled, the MAC operates in Half-Duplex mode.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>FLC</name>
					<description>FRAMELENGTH CHECKING. When enabled (set to 1), both transmit and receive frame lengths are compared to the Length/Type field. If the Length/Type field represents a length then the check is performed. Mismatches are reported in the StatusInfo word for each received frame.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>HFEN</name>
					<description>HUGE FRAME ENABLEWhen enabled (set to 1), frames of any length are transmitted and received.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DELAYEDCRC</name>
					<description>DELAYED CRC. This bit determines the number of bytes, if any, of proprietary header information that exist on the front of IEEE 802.3 frames. When 1, four bytes of header (ignored by the CRC function) are added. When 0, there is no proprietary header.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CRCEN</name>
					<description>CRC ENABLESet this bit to append a CRC to every frame whether padding was required or not. Must be set if PAD/CRC ENABLE is set. Clear this bit if frames presented to the MAC contain a CRC.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>PADCRCEN</name>
					<description>PAD CRC ENABLE. Set this bit to have the MAC pad all short frames. Clear this bit if frames presented to the MAC have a valid length. This bit is used in conjunction with AUTO PAD ENABLE and VLAN PAD ENABLE. See Table 153 - Pad Operation for details on the pad function.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>VLANPADEN</name>
					<description>VLAN PAD ENABLE. Set this bit to cause the MAC to pad all short frames to 64 bytes and append a valid CRC. Consult Table 153 - Pad Operation for more information on the various padding features. Note: This bit is ignored if PAD / CRC ENABLE is cleared.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>AUTODETPADEN</name>
					<description>AUTODETECTPAD ENABLE. Set this bit to cause the MAC to automatically detect the type of frame, either tagged or un-tagged, by comparing the two octets following the source address with 0x8100 (VLAN Protocol ID) and pad accordingly. Table 153 - Pad Operation provides a description of the pad function based on the configuration of this register. Note: This bit is ignored if PAD / CRC ENABLE is cleared.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>PPENF</name>
					<description>PURE PREAMBLE ENFORCEMEN. When enabled (set to 1), the MAC will verify the content of the preamble to ensure it contains 0x55 and is error-free. A packet with an incorrect preamble is discarded. When disabled, no preamble checking is performed.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>LPENF</name>
					<description>LONG PREAMBLE ENFORCEMENT. When enabled (set to 1), the MAC only allows receive packets which contain preamble fields less than 12 bytes in length. When disabled, the MAC allows any length preamble as per the Standard.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[11:10]</bitRange>
				</field>
				<field>
					<name>NOBACKOFF</name>
					<description>When enabled (set to 1), the MAC will immediately retransmit following a collision rather than using the Binary Exponential Backoff algorithm as specified in the Standard.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>BP_NOBACKOFF</name>
					<description>BACK PRESSURE / NO BACKOFF. When enabled (set to 1), after the MAC incidentally causes a collision during back pressure, it will immediately retransmit without backoff, reducing the chance of further collisions and ensuring transmit packets get sent.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EXCESSDEFER</name>
					<description>When enabled (set to 1) the MAC will defer to carrier indefinitely as per the Standard. When disabled, the MAC will abort when the excessive deferral limit is reached.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:15]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IPGT</name>
			<description>Back-to-Back Inter-Packet-Gap register.</description>
			<addressOffset>0x008</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BTOBINTEGAP</name>
					<description>BACK-TO-BACK INTER-PACKET-GAP.This is a programmable field representing the nibble time offset of the minimum possible period between the end of any transmitted packet to the beginning of the next. In Full-Duplex mode, the register value should be the desired period in nibble times minus 3. In Half-Duplex mode, the register value should be the desired period in nibble times minus 6. In Full-Duplex the recommended setting is 0x15 (21d), which represents the minimum IPG of 960 ns (in 100 Mbps mode) or 9.6 us (in 10 Mbps mode). In Half-Duplex the recommended setting is 0x12 (18d), which also represents the minimum IPG of 960 ns (in 100 Mbps mode) or 9.6 us (in 10 Mbps mode).</description>
					<bitRange>[6:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:7]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>IPGR</name>
			<description>Non Back-to-Back Inter-Packet-Gap register.</description>
			<addressOffset>0x00C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>NBTOBINTEGAP2</name>
					<description>NON-BACK-TO-BACK INTER-PACKET-GAP PART2. This is a programmable field representing the Non-Back-to-Back Inter-Packet-Gap. The recommended value is 0x12 (18d), which represents the minimum IPG of 960 ns (in 100 Mbps mode) or 9.6 us (in 10 Mbps mode).</description>
					<bitRange>[6:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>NBTOBINTEGAP1</name>
					<description>NON-BACK-TO-BACK INTER-PACKET-GAP PART1. This is a programmable field representing the optional carrierSense window referenced in IEEE 802.3/4.2.3.2.1 'Carrier Deference'. If carrier is detected during the timing of IPGR1, the MAC defers to carrier. If, however, carrier becomes active after IPGR1, the MAC continues timing IPGR2 and transmits, knowingly causing a collision, thus ensuring fair access to medium. Its range of values is 0x0 to IPGR2. The recommended value is 0xC (12d)</description>
					<bitRange>[14:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:15]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLRT</name>
			<description>Collision window / Retry register.</description>
			<addressOffset>0x010</addressOffset>
			<access>read-write</access>
			<resetValue>0x370F</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RETRANSMAX</name>
					<description>RETRANSMISSION MAXIMUM.This is a programmable field specifying the number of retransmission attempts following a collision before aborting the packet due to excessive collisions. The Standard specifies the attemptLimit to be 0xF (15d). See IEEE 802.3/4.2.3.2.5.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:4]</bitRange>
				</field>
				<field>
					<name>COLLWIN</name>
					<description>COLLISION WINDOW. This is a programmable field representing the slot time or collision window during which collisions occur in properly configured networks. The default value of 0x37 (55d) represents a 56 byte window following the preamble and SFD.</description>
					<bitRange>[13:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:14]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MAXF</name>
			<description>Maximum Frame register.</description>
			<addressOffset>0x014</addressOffset>
			<access>read-write</access>
			<resetValue>0x0600</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MAXFLEN</name>
					<description>MAXIMUM FRAME LENGTH. This field resets to the value 0x0600, which represents a maximum receive frame of 1536 octets. An untagged maximum size Ethernet frame is 1518 octets. A tagged frame adds four octets for a total of 1522 octets. If a shorter maximum length restriction is desired, program this 16-bit field.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SUPP</name>
			<description>PHY Support register.</description>
			<addressOffset>0x018</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>SPEED</name>
					<description>This bit configures the Reduced MII logic for the current operating speed. When set, 100 Mbps mode is selected. When cleared, 10 Mbps mode is selected.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:9]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TEST</name>
			<description>Test register.</description>
			<addressOffset>0x01C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SCPQ</name>
					<description>SHORTCUT PAUSE QUANTA. This bit reduces the effective PAUSE quanta from 64 byte-times to 1 byte-time.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>TESTPAUSE</name>
					<description>This bit causes the MAC Control sublayer to inhibit transmissions, just as if a PAUSE Receive Control frame with a nonzero pause time parameter was received.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>TESTBP</name>
					<description>TEST BACKPRESSURE. Setting this bit will cause the MAC to assert backpressure on the link. Backpressure causes preamble to be transmitted, raising carrier sense. A transmit packet from the system will be sent during backpressure.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:3]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MCFG</name>
			<description>MII Mgmt Configuration register.</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SCANINC</name>
					<description>SCAN INCREMENT. Set this bit to cause the MII Management hardware to perform read cycles across a range of PHYs. When set, the MII Management hardware will perform read cycles from address 1 through the value set in PHY ADDRESS[4:0]. Clear this bit to allow continuous reads of the same PHY.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SUPPPREAMBLE</name>
					<description>SUPPRESS PREAMBLE. Set this bit to cause the MII Management hardware to perform read/write cycles without the 32-bit preamble field. Clear this bit to cause normal cycles to be performed. Some PHYs support suppressed preamble.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>CLOCKSEL</name>
					<description>CLOCK SELECT. This field is used by the clock divide logic in creating the MII Management Clock (MDC) which IEEE 802.3u defines to be no faster than 2.5 MHz. Some PHYs support clock rates up to 12.5 MHz, however. The AHB bus clock (HCLK) is divided by the specified amount. Refer to Table 160 below for the definition of values for this field.</description>
					<bitRange>[5:2]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[14:6]</bitRange>
				</field>
				<field>
					<name>RESETMIIMGMT</name>
					<description>RESET MII MGMT. This bit resets the MII Management hardware.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MCMD</name>
			<description>MII Mgmt Command register.</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>READ</name>
					<description>This bit causes the MII Management hardware to perform a single Read cycle. The Read data is returned in Register MRDD (MII Mgmt Read Data).</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SCAN</name>
					<description>This bit causes the MII Management hardware to perform Read cycles continuously. This is useful for monitoring Link Fail for example.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MADR</name>
			<description>MII Mgmt Address register.</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>REGADDR</name>
					<description>REGISTER ADDRESS. This field represents the 5-bit Register Address field of Mgmt cycles. Up to 32 registers can be accessed.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[7:5]</bitRange>
				</field>
				<field>
					<name>PHYADDR</name>
					<description>PHY ADDRESS. This field represents the 5-bit PHY Address field of Mgmt cycles. Up to 31 PHYs can be addressed (0 is reserved).</description>
					<bitRange>[12:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MWTD</name>
			<description>MII Mgmt Write Data register.</description>
			<addressOffset>0x02C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WRITEDATA</name>
					<description>WRITE DATA. When written, an MII Mgmt write cycle is performed using the 16-bit data and the pre-configured PHY and Register addresses from the MII Mgmt Address register (MADR).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MRDD</name>
			<description>MII Mgmt Read Data register.</description>
			<addressOffset>0x030</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>READDATA</name>
					<description>READ DATA. Following an MII Mgmt Read Cycle, the 16-bit data can be read from this location.</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MIND</name>
			<description>MII Mgmt Indicators register.</description>
			<addressOffset>0x034</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>BUSY</name>
					<description>When 1 is returned - indicates MII Mgmt is currently performing an MII Mgmt Read or Write cycle.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SCANNING</name>
					<description>When 1 is returned - indicates a scan operation (continuous MII Mgmt Read cycles) is in progress.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>NOTVALID</name>
					<description>When 1 is returned - indicates MII Mgmt Read cycle has not completed and the Read Data is not yet valid.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>MIILINKFAIL</name>
					<description>When 1 is returned - indicates that an MII Mgmt link fail has occurred.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Unused</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
