ZigEmbeddedGroup/microzig/port/nxp/lpc/src/chips/LPC176x5x.svd
		<register>
			<name>DEVINTCLR</name>
			<description>USB Device Interrupt Clear</description>
			<addressOffset>0x208</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAMECLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EP_FASTCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EP_SLOWCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DEV_STATCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CCEMPTYCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CDFULLCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RxENDPKTCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TxENDPKTCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EP_RLZEDCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERR_INTCLR</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is cleared.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DEVINTSET</name>
			<description>USB Device Interrupt Set</description>
			<addressOffset>0x20C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAMESET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EP_FASTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EP_SLOWSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DEV_STATSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CCEMPTYSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CDFULLSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RxENDPKTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TxENDPKTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EP_RLZEDSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERR_INTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CMDCODE</name>
			<description>USB Command Code</description>
			<addressOffset>0x210</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:0]</bitRange>
					
				</field>
				<field>
					<name>CMD_PHASE</name>
					<description>The command phase:</description>
					<bitRange>[15:8]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>READ</name>
							<description>Read</description>
							<value>0x02</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WRITE</name>
							<description>Write</description>
							<value>0x01</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COMMAND</name>
							<description>Command</description>
							<value>0x05</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMD_CODE_WDATA</name>
					<description>This is a multi-purpose field. When CMD_PHASE is Command or Read, this field contains the code for the command (CMD_CODE). When CMD_PHASE is Write, this field contains the command write data (CMD_WDATA).</description>
					<bitRange>[23:16]</bitRange>
					
