ZigEmbeddedGroup/microzig/port/nxp/lpc/src/chips/LPC176x5x.svd
		<register>
			<name>REEP</name>
			<description>USB Realize Endpoint</description>
			<addressOffset>0x244</addressOffset>
			<access>read-write</access>
			<resetValue>0x3</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPR0</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPR1</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPR2</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPR3</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPR4</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPR5</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPR6</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPR7</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPR8</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPR9</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPR10</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPR11</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPR12</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPR13</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPR14</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPR15</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPR16</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPR17</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPR18</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPR19</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPR20</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPR21</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPR22</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPR23</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPR24</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPR25</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPR26</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPR27</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPR28</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPR29</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPR30</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPR31</name>
					<description>0 = Endpoint EPxx is not realized. 1 = Endpoint EPxx is realized.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPIND</name>
			<description>USB Endpoint Index</description>
			<addressOffset>0x248</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PHY_EP</name>
					<description>Physical endpoint number (0-31)</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>MAXPSIZE</name>
			<description>USB MaxPacketSize</description>
			<addressOffset>0x24C</addressOffset>
			<access>read-write</access>
			<resetValue>0x8</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>MPS</name>
					<description>The maximum packet size value.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		
		
		
		
		
		
		
		<register>
			<name>DMARST</name>
			<description>USB DMA Request Status</description>
			<addressOffset>0x250</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPRST0</name>
					<description>Control endpoint OUT (DMA cannot be enabled for this endpoint and EP0 bit must be 0).</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPRST1</name>
					<description>Control endpoint IN (DMA cannot be enabled for this endpoint and EP1 bit must be 0).</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPRST2</name>
					<description>Endpoint xx (2 &lt;=  xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPRST3</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPRST4</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPRST5</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPRST6</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPRST7</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPRST8</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPRST9</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPRST10</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPRST11</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPRST12</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPRST13</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPRST14</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPRST15</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPRST16</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPRST17</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPRST18</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPRST19</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPRST20</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPRST21</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPRST22</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPRST23</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPRST24</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPRST25</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPRST26</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPRST27</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPRST28</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPRST29</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPRST30</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPRST31</name>
					<description>Endpoint xx (2 &lt;= xx  &lt;= 31) DMA request. 0 = DMA not requested by endpoint xx. 1 = DMA requested by endpoint xx.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMARCLR</name>
			<description>USB DMA Request Clear</description>
			<addressOffset>0x254</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPRCLR0</name>
					<description>Control endpoint OUT (DMA cannot be enabled for this endpoint and the EP0 bit must be 0).</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPRCLR1</name>
					<description>Control endpoint IN (DMA cannot be enabled for this endpoint and the EP1 bit must be 0).</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPRCLR2</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPRCLR3</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPRCLR4</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPRCLR5</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPRCLR6</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPRCLR7</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPRCLR8</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPRCLR9</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPRCLR10</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPRCLR11</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPRCLR12</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPRCLR13</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPRCLR14</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPRCLR15</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPRCLR16</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPRCLR17</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPRCLR18</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPRCLR19</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPRCLR20</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPRCLR21</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPRCLR22</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPRCLR23</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPRCLR24</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPRCLR25</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPRCLR26</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPRCLR27</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPRCLR28</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPRCLR29</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPRCLR30</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPRCLR31</name>
					<description>Clear the endpoint xx (2 &lt;= xx &lt;= 31) DMA request. 0 = No effect 1 = Clear the corresponding bit in USBDMARSt.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
