ZigEmbeddedGroup/microzig/port/nxp/lpc/src/chips/LPC176x5x.svd
			</field>							
		</fields>								
	</register>									
	<register>									
		<name>I2C_CLKHI</name>								
		<description>I2C Clock High</description>								
		<addressOffset>0x30C</addressOffset>								
		<access>read-write</access>								
		<resetValue>0xB9</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>CDHI</name>						
				<description>Clock divisor high. This value is the number of 48 MHz clocks the serial clock (SCL) will be high.</description>						
				<bitRange>[7:0]</bitRange>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved. Read value is undefined, only zero should be written.</description>						
				<bitRange>[31:8]</bitRange>						
			</field>							
		</fields>								
	</register>									
	<register>									
		<name>I2C_CLKLO</name>								
		<description>I2C Clock Low</description>								
		<addressOffset>0x310</addressOffset>								
		<access>write-only</access>								
		<resetValue>0xB9</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>CDLO</name>						
				<description>Clock divisor low. This value is the number of 48 MHz clocks the serial clock (SCL) will be low.</description>						
				<bitRange>[7:0]</bitRange>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved. Read value is undefined, only zero should be written.</description>						
				<bitRange>[31:8]</bitRange>						
			</field>							
		</fields>								
	</register>	
		<register>			
			<name>USBCLKCTRL</name>		
			<description>USB Clock Control</description>
			
			<addressOffset>0xFF4</addressOffset>		
			<access>read-write</access>		
			<resetValue>0</resetValue>		
			<resetMask>0xFFFFFFFF</resetMask>		
			<fields>		
				<field>	
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[0:0]</bitRange>
				</field>	
				<field>	
					<name>DEV_CLK_EN</name>
					<description>Device clock enable.   Enables the usbclk input to the device controller</description>
					<bitRange>[1:1]</bitRange>
				</field>	
				<field>	
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[2:2]</bitRange>
				</field>	
				<field>	
					<name>PORTSEL_CLK_EN</name>
					<description>Port select register clock enable.</description>
					<bitRange>[3:3]</bitRange>
				</field>	
				<field>	
					<name>AHB_CLK_EN</name>
					<description>AHB clock enable</description>
					<bitRange>[4:4]</bitRange>
				</field>	
				<field>	
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:5]</bitRange>
				</field>	
			</fields>		
		</register>
	<register>									
		<name>OTGCLKCTRL</name>								
		<description>OTG clock controller</description>		
		<alternateRegister>USBCLKCTRL</alternateRegister>
		<addressOffset>0xFF4</addressOffset>								
		<access>read-write</access>								
		<resetValue>0</resetValue>								
		<resetMask>0xFFFFFFFF</resetMask>								
		<fields>								
			<field>							
				<name>HOST_CLK_EN</name>						
				<description>Host clock enable</description>						
				<bitRange>[0:0]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE_THE_HOST_CLO</name>				
						<description>Disable the Host clock.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE_THE_HOST_CLOC</name>				
						<description>Enable the Host clock.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>DEV_CLK_EN</name>						
				<description>Device clock enable</description>						
				<bitRange>[1:1]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE_THE_DEVICE_C</name>				
						<description>Disable the Device clock.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE_THE_DEVICE_CL</name>				
						<description>Enable the Device clock.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>I2C_CLK_EN</name>						
				<description>I2C clock enable</description>						
				<bitRange>[2:2]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE_THE_I2C_CLOC</name>				
						<description>Disable the I2C clock.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE_THE_I2C_CLOCK</name>				
						<description>Enable the I2C clock.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>OTG_CLK_EN</name>						
				<description>OTG clock enable. In device-only applications, this bit enables access to the PORTSEL register.</description>						
				<bitRange>[3:3]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE_THE_OTG_CLOC</name>				
						<description>Disable the OTG clock.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE_THE_OTG_CLOCK</name>				
						<description>Enable the OTG clock.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>AHB_CLK_EN</name>						
				<description>AHB master clock enable</description>						
				<bitRange>[4:4]</bitRange>						
				<enumeratedValues>						
				<name>ENUM</name>						
					<enumeratedValue>					
						<name>DISABLE_THE_AHB_CLOC</name>				
						<description>Disable the AHB clock.</description>				
						<value>0</value>				
					</enumeratedValue>					
					<enumeratedValue>					
						<name>ENABLE_THE_AHB_CLOCK</name>				
						<description>Enable the AHB clock.</description>				
						<value>1</value>				
					</enumeratedValue>					
				</enumeratedValues>						
			</field>							
			<field>							
				<name>RESERVED</name>						
				<description>Reserved. Read value is undefined, only zero should be written.</description>						
				<bitRange>[31:5]</bitRange>						
					
